
## Plan Result (sandbox)




<pre><code>Plan: 25 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-PASS-V14
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES-USER-V14
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V14
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.POSTGRES_PORT-V14
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.idam_password_for_tests[0]
  * azurerm_key_vault_secret.s2s-secret-for-tests
  * module.key-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b6d6303f-10de-4122-8aba-5f03b606543e&#34;]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;draftstore&#34;]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;draftstore&#34;]
* Update
  * module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY will be created
  + resource "azurerm_key_vault_secret" "AZURE_APPINSGHTS_KEY" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "AppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-PASS-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-USER-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-DATABASE-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-HOST-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "service-POSTGRES-PORT-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.idam_password_for_tests[0] will be created
  + resource "azurerm_key_vault_secret" "idam_password_for_tests" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "idam-password-for-tests"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.s2s-secret-for-tests will be created
  + resource "azurerm_key_vault_secret" "s2s-secret-for-tests" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + name                    = "s2s-secret-for-tests"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.Resources/deployments/Draft-store-bad-response-codes"
        name                     = "Draft-store-bad-response-codes"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + object_id               = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b6d6303f-10de-4122-8aba-5f03b606543e"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + object_id               = "b6d6303f-10de-4122-8aba-5f03b606543e"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
      + object_id               = "38f9dea6-e861-4a50-9e73-21e64f563537"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "draft-store-sandbox"
      + target_resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rpe-draft-store-v14-sandbox"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "rpe-draft-store-v14-data-sandbox"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/draft-store.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2024-07-30"
          + "managedBy"           = "Software Engineering"
          + "startupMode"         = "onDemand"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "rpe-draft-store-v14-data-sandbox"
      + server_name         = "rpe-draft-store-v14-sandbox"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_name      = "jenkins-cftsbox-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rpe-draft-store-v14-data-sandbox"
      + server_name         = "rpe-draft-store-v14-sandbox"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["draftstore"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "draftstore"
      + server_id = (known after apply)
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["draftstore"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "rpe-draft-store-v14"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 25 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1524,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->